/* Open Sensor Platform Project
 * https://github.com/sensorplatforms/open-sensor-platform
 *
 * Copyright (C) 2015 Audience Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *      http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
#if !defined (SENSOR_PACKETS_H)
#define   SENSOR_PACKETS_H

/*-------------------------------------------------------------------------------------------------*\
 |    I N C L U D E   F I L E S
 \*-------------------------------------------------------------------------------------------------*/
#define HOST_TARGET_BUILD              0
#define HUB_TARGET_BUILD               (!HOST_TARGET_BUILD)

#include <stdint.h>
#include <stddef.h>

#if (HOST_TARGET_BUILD)
#include "Common.h"
#endif


/*-------------------------------------------------------------------------------------------------*\
 |    C O N S T A N T S   &   M A C R O S
 \*-------------------------------------------------------------------------------------------------*/
#define INLINE __inline


#define PARAM_ID_POWER                  0x05
#define PARAM_ID_MINMAX_DELAY           0x06
#define PARAM_ID_FIFO_EVT_CNT           0x07
#define PARAM_ID_AXIS_MAPPING           0x08
#define PARAM_ID_CONVERSION_OFFSET      0x09
#define PARAM_ID_CONVERSION_SCALE       0x0A
#define PARAM_ID_SENSOR_NOISE           0x0B
#define PARAM_ID_TIMESTAMP_OFFSET       0x0C
#define PARAM_ID_ONTIME_WAKETIME        0x0D
#define PARAM_ID_HPF_LPF_CUTOFF         0x0E
#define PARAM_ID_SENSOR_NAME            0x0F
#define PARAM_ID_XYZ_OFFSET             0x10
#define PARAM_ID_F_SKOR_MATRIX          0x11
#define PARAM_ID_F_CAL_OFFSET           0x12
#define PARAM_ID_F_NONLINEAR_EFFECTS    0x13
#define PARAM_ID_BIAS_STABILITY         0x14
#define PARAM_ID_REPEATABILITY          0x15
#define PARAM_ID_TEMP_COEFF             0x16
#define PARAM_ID_SHAKE_SUSCEPTIBILITY   0x17
#define PARAM_ID_EXPECTED_NORM          0x18
#define PARAM_ID_VERSION                0x19
#define PARAM_ID_DYNAMIC_CAL_SCALE      0x1A
#define PARAM_ID_DYNAMIC_CAL_SKEW       0x1B
#define PARAM_ID_DYNAMIC_CAL_OFFSET     0x1C
#define PARAM_ID_DYNAMIC_CAL_ROTATION   0x1D
#define PARAM_ID_DYNAMIC_CAL_QUALITY    0x1E
#define PARAM_ID_DYNAMIC_CAL_SOURCE     0x1F
#define PARAM_ID_CONFIG_DONE            0x20
#define PARAM_ID_SH_TIME_SET            0x21
#define PARAM_ID_TIME_SYNC_START        0x22
#define PARAM_ID_TIME_SYNC_FOLLOW_UP    0x23
#define PARAM_ID_TIME_SYNC_END          0x24
#define N_PARAM_ID                      0x25  // array size

/** ================== CRC FIELD =================== */
#define CRC_SIZE                        2     // size in bytes


/* Byte extraction macros */
#define BYTE7(x)                        ((uint8_t)((x >> 56) & 0xFF))
#define BYTE6(x)                        ((uint8_t)((x >> 48) & 0xFF))
#define BYTE5(x)                        ((uint8_t)((x >> 40) & 0xFF))
#define BYTE4(x)                        ((uint8_t)((x >> 32) & 0xFF))
#define BYTE3(x)                        ((uint8_t)((x >> 24) & 0xFF))
#define BYTE2(x)                        ((uint8_t)((x >> 16) & 0xFF))
#define BYTE1(x)                        ((uint8_t)((x >> 8) & 0xFF))
#define BYTE0(x)                        ((uint8_t)(x & 0xFF))

/* 16-bit, 32-bit & 64-bit data macros */
#define BYTES_TO_SHORT(b1,b0)           ((int16_t)(((int16_t)b1 << 8) | b0))

#define BYTES_TO_LONG(b3,b2,b1,b0)      \
    ((int32_t)(((int32_t)b3 << 24) | ((uint32_t)b2 << 16) | ((uint32_t)b1 << 8) | b0))

#define BYTES_TO_LONGLONG(b7,b6,b5,b4,b3,b2,b1,b0)      \
    ((uint64_t)(((uint64_t)b7 << 56) | ((uint64_t)b6 << 48) | ((uint64_t)b5 << 40) | \
    ((uint64_t)b4 << 32) | ((uint64_t)b3 << 24) | ((uint64_t)b2 << 16) | ((uint64_t)b1 << 8) | b0))

/*-------------------------------------------------------------------------------------------------*\
 |    T Y P E   D E F I N I T I O N S
\*-------------------------------------------------------------------------------------------------*/

//! Time Stamp definition for capturing raw time counts
typedef union _TimeStamp {
    uint64_t TS64;
    uint32_t TS32[2];
    uint8_t  TS8[8];
} TimeStamp_t;

//! Generic structure definition for a 3-axis sensor raw values in 2's complement format
typedef struct TriAxisRawData_t
{
    TimeStamp_t  TStamp;
    int32_t      Axis[3];
} TriAxisRawData_t;

/* =============== Local Packet definitions ============= */

/* Definition for Sensor Data packets for internal usage */

typedef struct _QuaternionFixP {
    TimeStamp_t TimeStamp;
    int32_t     Quat[4]; //W,X,Y,Z order
} QuaternionFixP_t;

typedef struct _OrientationFixP {
    TimeStamp_t TimeStamp;
    int32_t     Pitch;
    int32_t     Roll;
    int32_t     Yaw;
} OrientationFixP_t;

typedef struct _ThreeAxisFixP {
    TimeStamp_t TimeStamp;
    int32_t     Axis[3];
    uint8_t     Accuracy;
} ThreeAxisFixP_t;

typedef struct _SignificantMotion {
    TimeStamp_t TimeStamp;
    uint8_t     MotionDetected;
} SignificantMotion_t;

typedef struct _StepCounter {
    TimeStamp_t TimeStamp;
    uint64_t    NumStepsTotal;
} StepCounter_t;

typedef struct _StepDetector {
    TimeStamp_t TimeStamp;
    uint8_t     StepDetected;
} StepDetector_t;

typedef struct _UncalibratedFixP {
    TimeStamp_t TimeStamp;
    int32_t     Axis[3];   //X,Y,Z order
    int32_t     Offset[3]; //XOFF,YOFF,ZOFF order
} UncalibratedFixP_t;

typedef struct _CalibratedFixP {
    TimeStamp_t TimeStamp;
    int32_t     Axis[3]; //X,Y,Z,
} CalibratedFixP_t;

/* Union of the structures that can be parsed out of Sensor Data packet */
typedef union _LocalSensorPktPayloadTypes_s {

    TriAxisRawData_t    RawSensor;
    UncalibratedFixP_t  UncalFixP;
    CalibratedFixP_t    CalFixP;
    QuaternionFixP_t    QuatFixP;
    OrientationFixP_t   OrientFixP;
    ThreeAxisFixP_t     ThreeAxisFixP;
    SignificantMotion_t SigMotion;
    StepCounter_t       StepCount;
    StepDetector_t      StepDetector;

} LocalSensorPktPayloadTypes_t;


typedef struct _LocalSensorPacketTypes_s {

    LocalSensorPktPayloadTypes_t P;

    uint8_t         DataFormatSensor;
    uint8_t         TimeStampFormat;
    uint8_t         Flush;
    uint8_t         DataSize;
    uint8_t         TimeStampSize;

} LocalSensorPacketTypes_t;

#define LOCAL_PACKET_TIMESTAMP_OFFSET  (offsetof( LocalSensorPacketTypes_t, P.UncalFixP.TimeStamp ))


/* Definition for Control Request/Response packets for internal usage */

typedef struct _LocalControlPktNoData_s {
    uint8_t NullData;
} LocalControlPktNoData_t;

typedef struct _LocalControlPktInt8_s {
    int8_t DataI8;
} LocalControlPktInt8_t;

typedef struct _LocalControlPktInt8x3_s {
    int8_t DataI8x3[3];
} LocalControlPktInt8x3_t;

typedef struct _LocalControlPktInt16x2_s {
    int16_t DataI16x2[2];
} LocalControlPktInt16x2_t;

typedef struct _LocalControlPktInt16x3_s {
    int16_t DataI16x3[3];
} LocalControlPktInt16x3_t;

typedef struct _LocalControlPktInt16x3x2_s {
    int16_t DataI16x3x2[3][2];
} LocalControlPktInt16x3x2_t;

typedef struct _LocalControlPktInt16x4x3_s {
    int16_t DataI16x4x3[4][3];
} LocalControlPktInt16x4x3_t;

typedef struct _LocalControlPktInt32_s {
    int32_t DataI32;
} LocalControlPktInt32_t;

typedef struct _LocalControlPktInt32x2_s {
    int32_t DataI32x2[2];
} LocalControlPktInt32x2_t;

typedef struct _LocalControlPktInt32x3_s {
    int32_t DataI32x3[3];
} LocalControlPktInt32x3_t;

typedef struct _LocalControlPktInt32x3x3_s {
    int32_t DataI32x3x3[3][3];
} LocalControlPktInt32x3x3_t;

typedef struct _LocalControlPktUint8_s {
    uint8_t DataU8;
} LocalControlPktUint8_t;

typedef struct _LocalControlPktUint8x32_s {
    uint8_t DataU8x32[32];
} LocalControlPktUint8x32_t;

typedef struct _LocalControlPktUint16x2_s {
    uint16_t DataU16x2[2];
} LocalControlPktUint16x2_t;

typedef struct _LocalControlPktUint32x2_s {
    uint32_t DataU32x2[2];
} LocalControlPktUint32x2_t;

typedef struct _LocalControlPktUint64x2_s {
    uint64_t DataU64x2[2];
} LocalControlPktUint64x2_t;

typedef struct _LocalControlPktUint64_s {
    uint64_t DataU64;
} LocalControlPktUint64_t;


typedef LocalControlPktInt32_t      LocalControlPktErrorCode_t;            // 0x00  PARAM_ID_ERROR_CODE_IN_DATA
typedef LocalControlPktUint8_t      LocalControlPktEnable_t;               // 0x01  PARAM_ID_ENABLE
typedef LocalControlPktUint64x2_t   LocalControlPktBatch_t;                // 0x02  PARAM_ID_BATCH
typedef LocalControlPktNoData_t     LocalControlPktFlush_t;                // 0x03  PARAM_ID_FLUSH
typedef LocalControlPktInt32x2_t    LocalControlPktRangeAndResolution_t;   // 0x04  PARAM_ID_RANGE_RESOLUTION
typedef LocalControlPktInt32_t      LocalControlPktPower_t;                // 0x05  PARAM_ID_POWER
typedef LocalControlPktInt32x2_t    LocalControlPktMinMaxDelay_t;          // 0x06  PARAM_ID_MINMAX_DELAY
typedef LocalControlPktUint32x2_t   LocalControlPktFifoEventCount_t;       // 0x07  PARAM_ID_FIFO_EVT_CNT

typedef LocalControlPktInt8x3_t     LocalControlPktAxisMapping_t;          // 0x08  PARAM_ID_AXIS_MAPPING
typedef LocalControlPktInt32x3_t    LocalControlPktConversionOffset_t;     // 0x09  PARAM_ID_CONVERSION_OFFSET
typedef LocalControlPktInt32x3_t    LocalControlPktConversionScale_t;      // 0x0A  PARAM_ID_CONVERSION_SCALE
typedef LocalControlPktInt32x3_t    LocalControlPktSensorNoise_t;          // 0x0B  PARAM_ID_SENSOR_NOISE
typedef LocalControlPktInt32_t      LocalControlPktTimeStampOffset_t;      // 0x0C  PARAM_ID_TIMESTAMP_OFFSET
typedef LocalControlPktUint32x2_t   LocalControlPktOnTimeWakeTime_t;       // 0x0D  PARAM_ID_ONTIME_WAKETIME
typedef LocalControlPktUint16x2_t   LocalControlPktHpfLpfCutoff_t;         // 0x0E  PARAM_ID_HPF_LPF_CUTOFF
typedef LocalControlPktUint8x32_t   LocalControlPktSensorName_t;           // 0x0F  PARAM_ID_SENSOR_NAME

typedef LocalControlPktInt32x3_t    LocalControlPktXyzOffset_t;            // 0x10  PARAM_ID_XYZ_OFFSET
typedef LocalControlPktInt32x3x3_t  LocalControlPktSkorMatrix_t;           // 0x11  PARAM_ID_F_SKOR_MATRIX
typedef LocalControlPktInt32x3_t    LocalControlPktFCalOffset_t;           // 0x12  PARAM_ID_F_CAL_OFFSET
typedef LocalControlPktInt16x4x3_t  LocalControlPktFNonlinearEffects_t;    // 0x13  PARAM_ID_F_NONLINEAR_EFFECTS
typedef LocalControlPktInt32x3_t    LocalControlPktBiasStability_t;        // 0x14  PARAM_ID_BIAS_STABILITY
typedef LocalControlPktInt32x3_t    LocalControlPktRepeatability_t;        // 0x15  PARAM_ID_REPEATABILITY
typedef LocalControlPktInt16x3x2_t  LocalControlPktTempCoeff_t;            // 0x16  PARAM_ID_TEMP_COEFF
typedef LocalControlPktInt16x3_t    LocalControlPktShakeSusceptibility_t;  // 0x17  PARAM_ID_SHAKE_SUSCEPTIBILITY

typedef LocalControlPktInt32_t      LocalControlPktExpectedNorm_t;         // 0x18  PARAM_ID_EXPECTED_NORM
typedef LocalControlPktUint8x32_t   LocalControlPktVersion_t;              // 0x19  PARAM_ID_VERSION
typedef LocalControlPktInt32x3_t    LocalControlPktDynamicCalScale_t;      // 0x1A  PARAM_ID_DYNAMIC_CAL_SCALE
typedef LocalControlPktInt32x3_t    LocalControlPktDynamicCalSkew_t;       // 0x1B  PARAM_ID_DYNAMIC_CAL_SKEW
typedef LocalControlPktInt32x3_t    LocalControlPktDynamicCalOffset_t;     // 0x1C  PARAM_ID_DYNAMIC_CAL_OFFSET
typedef LocalControlPktInt32x3_t    LocalControlPktDynamicCalRotation_t;   // 0x1D  PARAM_ID_DYNAMIC_CAL_ROTATION
typedef LocalControlPktInt32x3_t    LocalControlPktDynamicCalQuality_t;    // 0x1E  PARAM_ID_DYNAMIC_CAL_QUALITY
typedef LocalControlPktInt8_t       LocalControlPktDynamicCalSource_t;     // 0x1F  PARAM_ID_DYNAMIC_CAL_SOURCE

typedef LocalControlPktInt8_t       LocalControlPktConfigDone_t;           // 0x20  PARAM_ID_CONFIG_DONE

typedef LocalControlPktUint64_t     LocalControlPktSHTimeSet_t;            // 0x21  PARAM_ID_SH_TIME_SET
typedef LocalControlPktNoData_t     LocalControlPktTimeSyncStart_t;        // 0x22  PARAM_ID_TIME_SYNC_START
typedef LocalControlPktUint64_t     LocalControlPktTimeSyncFollowUp_t;     // 0x23  PARAM_ID_TIME_SYNC_FOLLOW_UP
typedef LocalControlPktUint64_t     LocalControlPktTimeSyncEnd_t;          // 0x24  PARAM_ID_TIME_SYNC_END

typedef union _LocalControlPktPayloadTypes_s {

    LocalControlPktErrorCode_t            ErrorCode;
    LocalControlPktEnable_t               Enable;
    LocalControlPktBatch_t                Batch;
    LocalControlPktFlush_t                Flush;
    LocalControlPktRangeAndResolution_t   RangeAndResolution;
    LocalControlPktPower_t                Power;
    LocalControlPktMinMaxDelay_t          MinMaxDelay;
    LocalControlPktFifoEventCount_t       FifoEventCount;

    LocalControlPktAxisMapping_t          AxisMapping;
    LocalControlPktConversionOffset_t     ConversionOffset;
    LocalControlPktConversionScale_t      ConversionScale;
    LocalControlPktSensorNoise_t          SensorNoise;
    LocalControlPktTimeStampOffset_t      TimeStampOffset;
    LocalControlPktOnTimeWakeTime_t       OnTimeWakeTime;
    LocalControlPktHpfLpfCutoff_t         HpfLpfCutoff;
    LocalControlPktSensorName_t           SensorName;

    LocalControlPktXyzOffset_t            XyzOffset;
    LocalControlPktSkorMatrix_t           SkorMatrix;
    LocalControlPktFCalOffset_t           FCalOffset;
    LocalControlPktFNonlinearEffects_t    FNonlinearEffects;
    LocalControlPktBiasStability_t        BiasStability;
    LocalControlPktRepeatability_t        Repeatibility;
    LocalControlPktTempCoeff_t            TempCoeff;
    LocalControlPktShakeSusceptibility_t  ShakeSusceptibility;

    LocalControlPktExpectedNorm_t         ExpectedNorm;
    LocalControlPktVersion_t              Version;
    LocalControlPktDynamicCalScale_t      DynamicCalScale;
    LocalControlPktDynamicCalSkew_t       DynamicCalSkew;
    LocalControlPktDynamicCalOffset_t     DynamicCalOffset;
    LocalControlPktDynamicCalRotation_t   DynamicCalRotation;
    LocalControlPktDynamicCalQuality_t    DynamicCalQuality;
    LocalControlPktDynamicCalSource_t     DynamicCalSource;

    LocalControlPktConfigDone_t           ConfigDone;

    LocalControlPktSHTimeSet_t            HubTimeSet;
    LocalControlPktTimeSyncStart_t        TimeSyncStart;
    LocalControlPktTimeSyncFollowUp_t     TimeSyncFUp;
    LocalControlPktTimeSyncEnd_t          TimeSyncEnd;

} LocalControlPktPayloadTypes_t;


/* Union of the structures that can be parsed out of Control packet */
typedef struct _LocalControlPacketTypes_s {

    LocalControlPktPayloadTypes_t  PL;

    uint8_t         DataFormatControl;
    uint8_t         ParameterID;
    uint8_t         SequenceNumber;

} LocalControlPacketTypes_t;


typedef struct _LocalPacketTypes_s {

    union {
        LocalSensorPacketTypes_t   SDP;
        LocalControlPacketTypes_t  CRP;
    } SCP;

    uint8_t         PacketID;
    uint8_t         Metadata;
    ASensorType_t   SType;      // if Private sensor, this has Private bit set at 0x10000
    uint8_t         SubType;
    int16_t         PayloadSize;

} LocalPacketTypes_t;

#define LOCAL_PKT_PAYLOAD_OFFSET        0



/* ========== Host Interface Packet definitions ========= */
/*
 * WARNING - Do not change structure definition without changing the handlers
 * and the document describing the Host Interface Protocol
 *
 * The structure fields in these packets must remain 8-bit types, to avoid
 * the padding the compiler would insert in between multi-byte fields
 * for type alignment.
 */

/* Sensor Data Host Interface Packet definitions */

/* Sensor Packet Type qualifier */
typedef struct _HifSensorPktQualifier {
    uint8_t ControlByte;
    uint8_t SensorIdByte;
    uint8_t AttributeByte;
} HifSnsrPktQualifier_t;

/* Basic packet: Raw 16-bit data, 32-bit integer time stamp; No checksum */
typedef struct _HifSensorDataRaw {
    HifSnsrPktQualifier_t Q;
    uint8_t TimeStamp[4];   //32-bit Time Stamp
    uint8_t DataRaw[6];     //3-Axis Raw 16-bit sensor data
    uint8_t CRCField[CRC_SIZE];
} HifSensorDataRaw_t;

#define SENSOR_RAW_DATA_PKT_SZ          sizeof(HifSensorDataRaw_t)
#define MIN_HIF_SENSOR_DATA_PKT_SZ      (offsetof(HifSensorDataRaw_t, CRCField) - CRC_SIZE) /* Without CRC field */

/* Uncalibrated data packet: 32-bit Fixedpoint uncalibrated; 64-bit Fixedpoint time stamp; No Checksum */
typedef struct _HifUncalibratedFixPoint {
    HifSnsrPktQualifier_t Q;
    uint8_t TimeStamp[8];   //64-bit Time Stamp in fixed point format
    uint8_t Data[12];       //3-Axis Fixed point 32-bit uncalibrated data
    uint8_t Offset[12];     //3-Axis Fixed point 32-bit Offset
    uint8_t CRCField[CRC_SIZE];
} HifUncalibratedFixPoint_t;

#define UNCALIB_FIXP_DATA_PKT_SZ        (offsetof(HifUncalibratedFixPoint_t, Offset))
#define UNCALIB_FIXP_DATA_OFFSET_PKT_SZ sizeof(HifUncalibratedFixPoint_t)

/* Calibrated data packet: 32-bit Fixedpoint Calibrated; 64-bit Fixedpoint time stamp; No Checksum */
typedef struct _HifCalibratedFixPoint {
    HifSnsrPktQualifier_t Q;
    uint8_t TimeStamp[8];   //64-bit Time Stamp in fixed point format
    uint8_t Data[12];       //3-Axis Fixed point 32-bit calibrated data
    uint8_t CRCField[CRC_SIZE];
} HifCalibratedFixPoint_t;

#define CALIBRATED_FIXP_DATA_PKT_SZ     sizeof(HifCalibratedFixPoint_t)

/* Three Axis Fixed Point data packet: 32-bit Fixedpoint Calibrated; 64-bit Fixedpoint time stamp; No Checksum */
typedef struct _HifThreeAxisPktFixPoint {
    HifSnsrPktQualifier_t Q;
    uint8_t TimeStamp[8];   //64-bit Time Stamp in fixed point format
    uint8_t Data[12];       //3-Axis Fixed point 32-bit calibrated data
    uint8_t CRCField[CRC_SIZE];
} HifThreeAxisPktFixPoint_t;

#define THREEAXIS_FIXP_DATA_PKT_SZ     sizeof(HifThreeAxisPktFixPoint_t)

/* SignificantMotion Fixed Point data packet: 32-bit Fixedpoint Calibrated; 64-bit Fixedpoint time stamp; No Checksum */
typedef struct _HifSignificantMotionPktFixPoint {
    HifSnsrPktQualifier_t Q;
    uint8_t TimeStamp[8];   //64-bit Time Stamp in fixed point format
    uint8_t significantMotionDetected;
    uint8_t CRCField[CRC_SIZE];
} HifSignificantMotionPktFixPoint_t;

#define SIGNIFICANTMOTION_FIXP_DATA_PKT_SZ     sizeof(HifSignificantMotionPktFixPoint_t)

/* StepCounter data packet: 64-bit Fixedpoint Calibrated; 64-bit Fixedpoint time stamp; No Checksum */
typedef struct _HifStepCounter {
    HifSnsrPktQualifier_t Q;
    uint8_t TimeStamp[8];   //64-bit Time Stamp in fixed point format
    uint8_t NumStepsTotal[8];
    uint8_t CRCField[CRC_SIZE];
} HifStepCounter_t;

#define STEPCOUNTER_DATA_PKT_SZ     sizeof(HifStepCounter_t)

/* StepDetector data packet: 8-bit Fixedpoint Calibrated; 64-bit Fixedpoint time stamp; No Checksum */
typedef struct _HifStepDetector {
    HifSnsrPktQualifier_t Q;
    uint8_t TimeStamp[8];   //64-bit Time Stamp in fixed point format
    uint8_t stepDetected;
    uint8_t CRCField[CRC_SIZE];
} HifStepDetector_t;

#define STEPDETECTOR_DATA_PKT_SZ     sizeof(HifStepDetector_t)

/* Orientation Fixed Point data packet: 32-bit Fixedpoint Calibrated; 64-bit Fixedpoint time stamp; No Checksum */
typedef struct _HifOrientationPktFixPoint {
    HifSnsrPktQualifier_t Q;
    uint8_t TimeStamp[8];                           //!< Time in seconds
    uint8_t Pitch[4];                           //!< pitch in degrees
    uint8_t Roll[4];                            //!< roll in degrees
    uint8_t Yaw[4];                             //!< yaw in degrees
    uint8_t CRCField[CRC_SIZE];
} HifOrientationPktFixPoint_t;

#define ORIENTATION_FIXP_DATA_PKT_SZ     sizeof(HifOrientationPktFixPoint_t)

/* Quaternion data packet: 32-bit Fixedpoint quaternion; 64-bit Fixedpoint time stamp; No Checksum */
typedef struct _HifQuaternionFixPoint {
    HifSnsrPktQualifier_t Q;
    uint8_t TimeStamp[8];   //64-bit Time Stamp in fixed point format
    uint8_t Data[16];       //4-Axis Fixed point 32-bit quaternion data
    uint8_t CRCField[CRC_SIZE];
} HifQuaternionFixPoint_t;

#define QUATERNION_FIXP_DATA_PKT_SZ     sizeof(HifQuaternionFixPoint_t)



/* Control Request/Response Host Interface Packet definitions */

typedef struct _HifControlPktNoData_s {
    HifSnsrPktQualifier_t Q;
    uint8_t AttrByte2;
    uint8_t CRCField[CRC_SIZE];
} HifControlPktNoData_t;

#define MIN_HIF_CONTROL_PKT_SZ      (offsetof(HifControlPktNoData_t, CRCField) - CRC_SIZE) /* Without CRC field */

typedef struct _HifControlPktInt8_s {
    HifSnsrPktQualifier_t Q;
    uint8_t AttrByte2;
    int8_t DataI8;
    uint8_t CRCField[CRC_SIZE];
} HifControlPktInt8_t;

typedef struct _HifControlPktInt8x3_s {
    HifSnsrPktQualifier_t Q;
    uint8_t AttrByte2;
    int8_t DataI8x3[3];
    uint8_t CRCField[CRC_SIZE];
} HifControlPktInt8x3_t;

typedef struct _HifControlPktInt16x2_s {
    HifSnsrPktQualifier_t Q;
    uint8_t AttrByte2;
    int8_t  DataI16x2[4];         // int16_t DataI16x2[2]
    uint8_t CRCField[CRC_SIZE];
} HifControlPktInt16x2_t;

typedef struct _HifControlPktInt16x3_s {
    HifSnsrPktQualifier_t Q;
    uint8_t AttrByte2;
    int8_t  DataI16x3[6];         // int16_t DataI16x3[3]
    uint8_t CRCField[CRC_SIZE];
} HifControlPktInt16x3_t;

typedef struct _HifControlPktInt16x3x2_s {
    HifSnsrPktQualifier_t Q;
    uint8_t AttrByte2;
    int8_t  DataI16x3x2[12];        // int16_t DataI16x3x2[3][2]
    uint8_t CRCField[CRC_SIZE];
} HifControlPktInt16x3x2_t;

typedef struct _HifControlPktInt16x4x3_s {
    HifSnsrPktQualifier_t Q;
    uint8_t AttrByte2;
    int8_t  DataI16x4x3[24];        // int16_t DataI16x4x3[4][3]
    uint8_t CRCField[CRC_SIZE];
} HifControlPktInt16x4x3_t;

typedef struct _HifControlPktInt32_s {
    HifSnsrPktQualifier_t Q;
    uint8_t AttrByte2;
    int8_t  DataI32[4];         // int32_t DataI32
    uint8_t CRCField[CRC_SIZE];
} HifControlPktInt32_t;

typedef struct _HifControlPktInt32x2_s {
    HifSnsrPktQualifier_t Q;
    uint8_t AttrByte2;
    int8_t  DataI32x2[8];         // int32_t DataI32x2[2];
    uint8_t CRCField[CRC_SIZE];
} HifControlPktInt32x2_t;

typedef struct _HifControlPktInt32x3_s {
    HifSnsrPktQualifier_t Q;
    uint8_t AttrByte2;
    int8_t  DataI32x3[12];        // int32_t DataI32x3[3];
    uint8_t CRCField[CRC_SIZE];
} HifControlPktInt32x3_t;

typedef struct _HifControlPktInt32x3x3_s {
    HifSnsrPktQualifier_t Q;
    uint8_t AttrByte2;
    int8_t  DataI32x3x3[36];        // int32_t DataI32x3x3[3][3];
    uint8_t CRCField[CRC_SIZE];
} HifControlPktInt32x3x3_t;

typedef struct _HifControlPktUint8_s {
    HifSnsrPktQualifier_t Q;
    uint8_t AttrByte2;
    uint8_t DataU8;
    uint8_t CRCField[CRC_SIZE];
} HifControlPktUint8_t;

typedef struct _HifControlPktUint8x32_s {
    HifSnsrPktQualifier_t Q;
    uint8_t AttrByte2;
    uint8_t DataU8x32[32];
    uint8_t CRCField[CRC_SIZE];
} HifControlPktUint8x32_t;

typedef struct _HifControlPktUint16x2_s {
    HifSnsrPktQualifier_t Q;
    uint8_t AttrByte2;
    int8_t  DataU16x2[4];         // uint16_t DataU16[2];
    uint8_t CRCField[CRC_SIZE];
} HifControlPktUint16x2_t;

typedef struct _HifControlPktUint32x2_s {
    HifSnsrPktQualifier_t Q;
    uint8_t AttrByte2;
    int8_t  DataU32x2[8];         // uint32_t DataU32[2];
    uint8_t CRCField[CRC_SIZE];
} HifControlPktUint32x2_t;

typedef struct _HifControlPktUint64x2_s {
    HifSnsrPktQualifier_t Q;
    uint8_t AttrByte2;
    int8_t  DataU64x2[16];         // uint64_t DataU64[2];
    uint8_t CRCField[CRC_SIZE];
} HifControlPktUint64x2_t;

typedef struct _HifControlPktUint64_s {
    HifSnsrPktQualifier_t Q;
    uint8_t AttrByte2;
    int8_t  DataU64[8];         // uint64_t DataU64;
    uint8_t CRCField[CRC_SIZE];
} HifControlPktUint64_t;

typedef HifControlPktInt32_t       HifControlPktErrorCode_t;            // 0x00  PARAM_ID_ERROR_CODE_IN_DATA
typedef HifControlPktUint8_t       HifControlPktEnable_t;               // 0x01  PARAM_ID_ENABLE
typedef HifControlPktUint64x2_t    HifControlPktBatch_t;                // 0x02  PARAM_ID_BATCH
typedef HifControlPktNoData_t      HifControlPktFlush_t;                // 0x03  PARAM_ID_FLUSH
typedef HifControlPktInt32x2_t     HifControlPktRangeAndResolution_t;   // 0x04  PARAM_ID_RANGE_RESOLUTION
typedef HifControlPktInt32_t       HifControlPktPower_t;                // 0x05  PARAM_ID_POWER
typedef HifControlPktInt32x2_t     HifControlPktMinMaxDelay_t;          // 0x06  PARAM_ID_MINMAX_DELAY
typedef HifControlPktUint32x2_t    HifControlPktFifoEventCount_t;       // 0x07  PARAM_ID_FIFO_EVT_CNT

typedef HifControlPktInt8x3_t      HifControlPktAxisMapping_t;          // 0x08  PARAM_ID_AXIS_MAPPING
typedef HifControlPktInt32x3_t     HifControlPktConversionOffset_t;     // 0x09  PARAM_ID_CONVERSION_OFFSET
typedef HifControlPktInt32x3_t     HifControlPktConversionScale_t;      // 0x0A  PARAM_ID_CONVERSION_SCALE
typedef HifControlPktInt32x3_t     HifControlPktSensorNoise_t;          // 0x0B  PARAM_ID_SENSOR_NOISE
typedef HifControlPktInt32_t       HifControlPktTimeStampOffset_t;      // 0x0C  PARAM_ID_TIMESTAMP_OFFSET
typedef HifControlPktUint32x2_t    HifControlPktOnTimeWakeTime_t;       // 0x0D  PARAM_ID_ONTIME_WAKETIME
typedef HifControlPktUint16x2_t    HifControlPktHpfLpfCutoff_t;         // 0x0E  PARAM_ID_HPF_LPF_CUTOFF
typedef HifControlPktUint8x32_t    HifControlPktSensorName_t;           // 0x0F  PARAM_ID_SENSOR_NAME

typedef HifControlPktInt32x3_t     HifControlPktXyzOffset_t;            // 0x10  PARAM_ID_XYZ_OFFSET
typedef HifControlPktInt32x3x3_t   HifControlPktSkorMatrix_t;           // 0x11  PARAM_ID_F_SKOR_MATRIX
typedef HifControlPktInt32x3_t     HifControlPktFCalOffset_t;           // 0x12  PARAM_ID_F_CAL_OFFSET
typedef HifControlPktInt16x4x3_t   HifControlPktFNonlinearEffects_t;    // 0x13  PARAM_ID_F_NONLINEAR_EFFECTS
typedef HifControlPktInt32x3_t     HifControlPktBiasStability_t;        // 0x14  PARAM_ID_BIAS_STABILITY
typedef HifControlPktInt32x3_t     HifControlPktRepeatability_t;        // 0x15  PARAM_ID_REPEATABILITY
typedef HifControlPktInt16x3x2_t   HifControlPktTempCoeff_t;            // 0x16  PARAM_ID_TEMP_COEFF
typedef HifControlPktInt16x3_t     HifControlPktShakeSusceptibility_t;  // 0x17  PARAM_ID_SHAKE_SUSCEPTIBILITY

typedef HifControlPktInt32_t       HifControlPktExpectedNorm_t;         // 0x18  PARAM_ID_EXPECTED_NORM
typedef HifControlPktUint8x32_t    HifControlPktVersion_t;              // 0x19  PARAM_ID_VERSION
typedef HifControlPktInt32x3_t     HifControlPktDynamicCalScale_t;      // 0x1A  PARAM_ID_DYNAMIC_CAL_SCALE
typedef HifControlPktInt32x3_t     HifControlPktDynamicCalSkew_t;       // 0x1B  PARAM_ID_DYNAMIC_CAL_SKEW
typedef HifControlPktInt32x3_t     HifControlPktDynamicCalOffset_t;     // 0x1C  PARAM_ID_DYNAMIC_CAL_OFFSET
typedef HifControlPktInt32x3_t     HifControlPktDynamicCalRotation_t;   // 0x1D  PARAM_ID_DYNAMIC_CAL_ROTATION
typedef HifControlPktInt32x3_t     HifControlPktDynamicCalQuality_t;    // 0x1E  PARAM_ID_DYNAMIC_CAL_QUALITY
typedef HifControlPktInt8_t        HifControlPktDynamicCalSource_t;     // 0x1F  PARAM_ID_DYNAMIC_CAL_SOURCE

typedef HifControlPktNoData_t      HifControlPktConfigDone_t;           // 0x20  PARAM_ID_CONFIG_DONE

typedef HifControlPktUint64_t      HifControlPktSHTimeSet_t;            // 0x21  PARAM_ID_SH_TIME_SET
typedef HifControlPktNoData_t      HifControlPktTimeSyncStart_t;        // 0x22  PARAM_ID_TIME_SYNC_START
typedef HifControlPktUint64_t      HifControlPktTimeSyncFollowUp_t;     // 0x23  PARAM_ID_TIME_SYNC_FOLLOW_UP
typedef HifControlPktUint64_t      HifControlPktTimeSyncEnd_t;          // 0x24  PARAM_ID_TIME_SYNC_END



/* Define union for all the host interface packet types */

typedef union _HostIFPackets {

    HifSensorDataRaw_t                  SensPktRaw;
    HifUncalibratedFixPoint_t           UncalPktFixP;
    HifCalibratedFixPoint_t             CalPktFixP;
    HifQuaternionFixPoint_t             QuatPktFixP;
    HifOrientationPktFixPoint_t         OrientationFixP;
    HifThreeAxisPktFixPoint_t           ThreeAxisFixp;
    HifSignificantMotionPktFixPoint_t   SignificantMotion;
    HifStepCounter_t                    StepCounter;
    HifStepDetector_t                   StepDetector;

    HifControlPktErrorCode_t            ErrorCode;
    HifControlPktEnable_t               Enable;
    HifControlPktBatch_t                Batch;
    HifControlPktFlush_t                Flush;
    HifControlPktRangeAndResolution_t   RangeAndResolution;
    HifControlPktPower_t                Power;
